src/InformationRegisters/ТокеныМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТокеныМаркировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТокена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТокеновАвторизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыТокеновАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыТокеновАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СУЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ТокеныМаркировки/Ext/ManagerModule.bsl
// Модуль менеджера регистра сведений "Клиентские токены СУЗ"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПараметрыТокенов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РегистрСведенийТокеныМаркировки.Организация,
	|	РегистрСведенийТокеныМаркировки.ПодразделениеКомпании,
	|	РегистрСведенийТокеныМаркировки.ТипТокена,
	|	РегистрСведенийТокеныМаркировки.ИдентификаторСоединения,
	|	ВЫБОР
	|		КОГДА РегистрСведенийТокеныМаркировкиДубль.ТипТокена ЕСТЬ NULL ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ КАК ЕстьДубль
	|ИЗ
	|	РегистрСведений.ТокеныМаркировки КАК РегистрСведенийТокеныМаркировки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТокеныМаркировки КАК РегистрСведенийТокеныМаркировкиДубль
	|ПО
	|	РегистрСведенийТокеныМаркировки.Организация = РегистрСведенийТокеныМаркировкиДубль.Организация И 
	|	РегистрСведенийТокеныМаркировки.ИдентификаторСоединения = РегистрСведенийТокеныМаркировкиДубль.ИдентификаторСоединения И 
	|	(НЕ РегистрСведенийТокеныМаркировки.ТипТокена = РегистрСведенийТокеныМаркировкиДубль.ТипТокена)
	|ГДЕ
	|	РегистрСведенийТокеныМаркировки.ТипТокена = ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ТокеныМаркировки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Организация = Выборка.Организация;
		МенеджерЗаписи.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
		МенеджерЗаписи.ТипТокена = Выборка.ТипТокена;
		МенеджерЗаписи.ИдентификаторСоединения = Выборка.ИдентификаторСоединения;
		
		Если Выборка.ЕстьДубль Тогда
			МенеджерЗаписи.Удалить();
		Иначе
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Организация = Выборка.Организация;
			МенеджерЗаписи.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
			МенеджерЗаписи.ИдентификаторСоединения = Выборка.ИдентификаторСоединения;
			Если ПустаяСтрока(Выборка.ИдентификаторСоединения) Тогда
				МенеджерЗаписи.ТипТокена = Перечисления.ТипыТокеновАвторизации.Маркировка;
			Иначе
				МенеджерЗаписи.ТипТокена = Перечисления.ТипыТокеновАвторизации.СУЗ;
			КонецЕсли;
			МенеджерЗаписи.СрокДействия = ТекущаяУниверсальнаяДата()-86400;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#Область Печать

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Стандартные команды печати
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Обработчики печати
	
КонецПроцедуры // Печать()

#КонецОбласти

#КонецОбласти

#КонецЕсли
